In [2]:
from urllib.parse import quote
encoded_password = quote("Mubeen@12345", safe="")
connection_string = f"mysql+pymysql://sweeterror404:{encoded_password}@localhost:3306/mubeen"
%load_ext sql
%sql $connection_string

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Trigger</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><ul>TRIGGER statement in MySQL is a powerful feature that automatically executes when a specific event occurs on a table. <br>These events include INSERT, UPDATE, DELETE, and a few other operations.<br> Whenever the defined event occurs on the table, the trigger is executed, and specified logic or actions are performed.</ul><br>
<hr>
Syntax :
<ul>CREATE TRIGGER trigger_name <br>
{BEFORE | AFTER} {INSERT | UPDATE | DELETE}<br>
ON table_name FOR EACH ROW<br>
trigger_body</ul><ul><br><br>
    <li>trigger_name:</li> <ul><li>A unique name for the trigger.</li></ul><br>
    <li>BEFORE | AFTER:</li> <ul><li>Specifies the timing of the event, whether the trigger should execute before or after the event.</li></ul><br>
    <li>INSERT | UPDATE | DELETE: </li> <ul><li>Specifies which event will activate the trigger.</li></ul><br>
    <li>table_name: </li> <ul><li>The name of the table on which the trigger will be applied.</li></ul><br>
    <li>FOR EACH ROW:</li> <ul><li> Specifies that the trigger should be applied for each row.</li></ul><br>
    <li>trigger_body</li> <ul><li>Defines the actions or logic of the trigger.</li></ul>
</ul>

</div>

In [15]:
%sql DROP TRIGGER log_actions

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [5]:
%%sql 
CREATE TABLE users_data(name VARCHAR(255),update_time VARCHAR(255));

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">INSERT Trigger</h1>

In [6]:
%%sql
CREATE TRIGGER before_insert

BEFORE INSERT
ON users_data FOR EACH ROW

SET NEW.update_time = NOW();

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Check the table

In [7]:
%sql SELECT * FROM users_data;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now Insert The Values<br> here insert only name column but before insertion update_time are automatic updated
</div>

In [8]:
%sql INSERT INTO users_data(name) VALUES ('Mubeen');

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [9]:
%sql SELECT * FROM users_data;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('Mubeen', '2024-03-15 21:53:44')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here update_time are auto deleted
</div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">CHECK Status Trigger
</div>

In [16]:
%sql SHOW TRIGGERS

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('before_insert', 'INSERT', 'users_data', 'SET NEW.update_time = NOW()', 'BEFORE', datetime.datetime(2024, 3, 15, 21, 51, 30, 550000), 'ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION', 'sweeterror404@127.0.0.1', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">DROP The Trigger
</div>

In [17]:
%sql DROP TRIGGER before_insert;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [18]:
%sql SHOW TRIGGERS -- again check

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Example  2 we also use BEGIN END like store procedures in Triggers
</div>

In [20]:
%%sql
DROP TABLE IF EXISTS users_data;
CREATE TABLE IF NOT EXISTS users_data(id INT,name VARCHAR(50));


-- trigger
CREATE TRIGGER unique_id
BEFORE INSERT 
ON users_data FOR EACH ROW

BEGIN

    DECLARE new_id INT;
    SELECT MAX(id) + 1 INTO new_id FROM users_data;

    IF new_id IS NULL THEN
        SET new_id = 1;
    END IF;
    SET NEW.id = new_id;

END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [21]:
%sql SELECT * FROM users_data;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [22]:
%sql INSERT INTO users_data(name) VALUES('mubeen') -- here id is automatic insertation

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [23]:
%sql SELECT * FROM users_data;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'mubeen')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">if we insert the maximum id than trigger are auto handler
</div>

In [24]:
%sql INSERT INTO users_data(id,name) VALUES(6,'mubeen');

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [124]:
%sql SELECT * FROM users_data;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(1, 'mubeen'), (2, 'mubeen')]

In [25]:
%sql DROP TRIGGER unique_id;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">We also user multiple Triggers on Same time
</div>

In [26]:
%%sql
DROP TABLE IF EXISTS users_data;
CREATE TABLE IF NOT EXISTS 
users_data(id INT,update_time VARCHAR(50),name VARCHAR(50));


-- trigger
CREATE TRIGGER unique_id
BEFORE INSERT 
ON users_data FOR EACH ROW
BEGIN

    DECLARE new_id INT;
    SELECT MAX(id) + 1 INTO new_id FROM users_data;

    IF new_id IS NULL THEN
        SET new_id = 1;
    END IF;
    SET NEW.id = new_id;

END;

-- update time
CREATE TRIGGER before_insert
BEFORE INSERT
ON users_data FOR EACH ROW

SET NEW.update_time = NOW();

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [27]:
%sql SELECT * FROM users_data;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [29]:
%sql INSERT INTO users_data(name) VALUES('mubeen'); -- here id, and update_time are automatic updated

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [30]:
%sql SELECT * FROM users_data;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, '2024-03-15 22:06:39', 'mubeen')]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">AFTER Example
</div>

In [31]:
%%sql
DROP TABLE IF EXISTS users_data;
CREATE TABLE IF NOT EXISTS users_data (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(50)
);

DROP TABLE IF EXISTS users_data_audit;

CREATE TABLE IF NOT EXISTS users_data_audit (
    user_id INT,
    action VARCHAR(50),
    timestamp TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [32]:
%sql SELECT * FROM users_data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [33]:
%sql SELECT * FROM users_data_audit

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [34]:
%%sql
CREATE TRIGGER after_insert_users_data
AFTER INSERT 
ON users_data FOR EACH ROW
INSERT INTO users_data_audit (user_id, action) VALUES (NEW.id, 'INSERT');

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [35]:
%sql INSERT INTO users_data(name) VALUES ('Mubeen');

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [36]:
%sql SELECT * FROM users_data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'Mubeen')]

In [37]:
%sql SELECT * FROM users_data_audit

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 35))]

In [38]:
%%sql 
INSERT INTO users_data(name) VALUES 
('Ali'),('Imran'),('Naveed'),('Rizwan');

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
4 rows affected.

[]

In [251]:
%sql SELECT * FROM users_data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
5 rows affected.

[(1, 'Mubeen'), (2, 'Ali'), (3, 'Imran'), (4, 'Naveed'), (5, 'Rizwan')]

In [39]:
%sql SELECT * FROM users_data_audit

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
5 rows affected.

[(1, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 35)),
 (2, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 56)),
 (3, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 56)),
 (4, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 56)),
 (5, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 56))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">NOTE ! In an INSERT trigger, only NEW.col_name can be used because the old row does not exist.<br>The NEW is read-only.
</div><hr>

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">DELETE Trigger</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">BEFORE example
</div>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">In a DELETE trigger, only OLD.col_name can be used because the new row does not exist. <br>The OLD is read-only.
</div>

In [40]:
%sql SELECT * FROM users_data_audit

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
5 rows affected.

[(1, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 35)),
 (2, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 56)),
 (3, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 56)),
 (4, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 56)),
 (5, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 56))]

In [43]:
%%sql
CREATE TRIGGER before_delete
BEFORE DELETE ON users_data
FOR EACH ROW

UPDATE users_data_audit
SET 
    action = "DELETE",
    timestamp = CURRENT_TIMESTAMP

WHERE user_id = OLD.id -- here old.id is users_data id

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [45]:
%sql SELECT * FROM users_data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
5 rows affected.

[(1, 'Mubeen'), (2, 'Ali'), (3, 'Imran'), (4, 'Naveed'), (5, 'Rizwan')]

In [46]:
%sql SELECT * FROM users_data_audit

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
5 rows affected.

[(1, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 35)),
 (2, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 56)),
 (3, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 56)),
 (4, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 56)),
 (5, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 56))]

In [47]:
%sql DELETE FROM users_data WHERE id = 4

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [48]:
%sql SELECT * FROM users_data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
4 rows affected.

[(1, 'Mubeen'), (2, 'Ali'), (3, 'Imran'), (5, 'Rizwan')]

In [49]:
%sql SELECT * FROM users_data_audit -- here users_data_audit are auto updated

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
5 rows affected.

[(1, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 35)),
 (2, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 56)),
 (3, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 56)),
 (4, 'DELETE', datetime.datetime(2024, 3, 15, 22, 50, 13)),
 (5, 'INSERT', datetime.datetime(2024, 3, 15, 22, 10, 56))]

In [50]:
%sql DELETE FROM users_data WHERE id IN (1,2,3,5)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
4 rows affected.

[]

In [51]:
%sql SELECT * FROM users_data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [52]:
%sql SELECT * FROM users_data_audit

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
5 rows affected.

[(1, 'DELETE', datetime.datetime(2024, 3, 15, 22, 51, 35)),
 (2, 'DELETE', datetime.datetime(2024, 3, 15, 22, 51, 35)),
 (3, 'DELETE', datetime.datetime(2024, 3, 15, 22, 51, 35)),
 (4, 'DELETE', datetime.datetime(2024, 3, 15, 22, 50, 13)),
 (5, 'DELETE', datetime.datetime(2024, 3, 15, 22, 51, 35))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">AFTER example
</div>

In [53]:
%%sql
DROP TABLE IF EXISTS users_data;
CREATE TABLE IF NOT EXISTS users_data (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(50)
);

DROP TABLE IF EXISTS users_data_audit;


CREATE TABLE IF NOT EXISTS users_data_audit (
    user_id INT,
    action VARCHAR(50),
    timestamp TIMESTAMP DEFAULT CURRENT_TIMESTAMP
);

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [54]:
%sql SELECT * FROM users_data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [55]:
%sql SELECT * FROM users_data_audit

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [56]:
%%sql
CREATE TRIGGER after_insert_users_data
AFTER INSERT
ON users_data FOR EACH ROW

INSERT INTO users_data_audit (user_id, action) 
VALUES (NEW.id, 'INSERT');

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [57]:
%%sql 
INSERT INTO users_data(name) VALUES 
('Ali'),('Imran'),('Naveed'),('Rizwan');

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
4 rows affected.

[]

In [58]:
%sql SELECT * FROM users_data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
4 rows affected.

[(1, 'Ali'), (2, 'Imran'), (3, 'Naveed'), (4, 'Rizwan')]

In [59]:
%sql SELECT * FROM users_data_audit

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
4 rows affected.

[(1, 'INSERT', datetime.datetime(2024, 3, 15, 22, 53, 10)),
 (2, 'INSERT', datetime.datetime(2024, 3, 15, 22, 53, 10)),
 (3, 'INSERT', datetime.datetime(2024, 3, 15, 22, 53, 10)),
 (4, 'INSERT', datetime.datetime(2024, 3, 15, 22, 53, 10))]

In [60]:
%%sql
CREATE TRIGGER after_delete
AFTER DELETE
ON users_data FOR EACH ROW

DELETE FROM users_data_audit
WHERE user_id = OLD.id

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now if we delete the user_data than users_data_audit are also deleted
</div>

In [61]:
%sql DELETE FROM users_data WHERE id = 1;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [62]:
%sql SELECT * FROM users_data

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(2, 'Imran'), (3, 'Naveed'), (4, 'Rizwan')]

In [63]:
%sql SELECT * FROM users_data_audit

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(2, 'INSERT', datetime.datetime(2024, 3, 15, 22, 53, 10)),
 (3, 'INSERT', datetime.datetime(2024, 3, 15, 22, 53, 10)),
 (4, 'INSERT', datetime.datetime(2024, 3, 15, 22, 53, 10))]

<hr>
<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">UPDATE Trigger</h1>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><ul><li>In an UPDATE trigger, you can use OLD.col_name to refer to the columns of a row before it is updated, and NEW.col_name to refer to the columns of the row after it is updated.</li><br>
<li> The OLD column is read-only, and you cannot modify it.</li><br>
<li>You can refer to a column named with NEW if you have the SELECT privilege for it. </li><br>
<li>In a BEFORE trigger, you can also change its value with SET NEW.col_name = value if you have the UPDATE privilege for it.</li><br>
<li>In a BEFORE trigger, the NEW value for an AUTO_INCREMENT column is 0, not the sequence number that is generated automatically when the new row actually is inserted.</li>
</ul>
</div>

In [64]:
%sql SHOW TRIGGERS

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[('after_insert_users_data', 'INSERT', 'users_data', "INSERT INTO users_data_audit (user_id, action) \nVALUES (NEW.id, 'INSERT')", 'AFTER', datetime.datetime(2024, 3, 15, 22, 53, 8, 680000), 'ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION', 'sweeterror404@127.0.0.1', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci'),
 ('after_delete', 'DELETE', 'users_data', 'DELETE FROM users_data_audit\nWHERE user_id = OLD.id', 'AFTER', datetime.datetime(2024, 3, 15, 22, 56, 23, 280000), 'ONLY_FULL_GROUP_BY,STRICT_TRANS_TABLES,NO_ZERO_IN_DATE,NO_ZERO_DATE,ERROR_FOR_DIVISION_BY_ZERO,NO_ENGINE_SUBSTITUTION', 'sweeterror404@127.0.0.1', 'utf8mb4', 'utf8mb4_0900_ai_ci', 'utf8mb4_0900_ai_ci')]

In [65]:
%%sql 
DROP TRIGGER after_insert_users_data;
DROP TRIGGER after_delete;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
0 rows affected.

[]

In [96]:
%%sql

DROP TABLE IF EXISTS employees;
CREATE TABLE IF NOT EXISTS employees (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    salary INT
);

INSERT INTO employees VALUES (1, 'Mubeen', 50000);

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
0 rows affected.
1 rows affected.

[]

In [97]:
%sql SELECT * FROM employees;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'Mubeen', 50000)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">before Example
</div>

In [98]:
%%sql
CREATE TRIGGER before_update
BEFORE UPDATE 
ON employees FOR EACH ROW
SET 
@rec = CONCAT(
    'ID : ',OLD.id,'\nNAME : ',
     OLD.NAME, '\nOLD SALARY : ',
     OLD.salary, '\nNEW SALARY : ',
     NEW.salary
);

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [99]:
%sql SELECT * FROM employees;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'Mubeen', 50000)]

In [102]:
%sql SELECT @rec;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(None,)]

In [103]:
%sql UPDATE employees SET salary = 60000 WHERE id = 1;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [104]:
%sql SELECT @rec;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('ID : 1\nNAME : Mubeen\nOLD SALARY : 50000\nNEW SALARY : 60000',)]

In [105]:
%sql SELECT * FROM employees;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'Mubeen', 60000)]

In [106]:
%sql UPDATE employees SET salary = 20000 WHERE id = 1;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [107]:
%sql SELECT @rec;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[('ID : 1\nNAME : Mubeen\nOLD SALARY : 60000\nNEW SALARY : 20000',)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Before Example 2
</div>

In [108]:
%%sql
CREATE TRIGGER limit_salary_increase
BEFORE UPDATE ON employees
FOR EACH ROW

BEGIN            -- here i use IF condition thats why i use BEGIN END;
    IF NEW.salary > 70000 THEN
        SET NEW.salary = 70000;
    END IF;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [109]:
%sql SELECT * FROM employees;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'Mubeen', 20000)]

In [110]:
%sql UPDATE employees SET salary = 80000 WHERE id = 1;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [111]:
%sql SELECT * FROM employees;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'Mubeen', 70000)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Note here limit_salary_increase <br>i use BEFORE Trigger what happend if i use after Trigger ?
</div>

In [112]:
%sql DROP TRIGGER limit_salary_increase;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [113]:
%%sql
CREATE TRIGGER limit_salary_increase
AFTER UPDATE ON employees
FOR EACH ROW

BEGIN 
    IF NEW.salary > 70000 THEN
        SET NEW.salary = 70000;
    END IF;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
(pymysql.err.OperationalError) (1362, 'Updating of NEW row is not allowed in after trigger')
[SQL: CREATE TRIGGER limit_salary_increase
AFTER UPDATE ON employees
FOR EACH ROW

BEGIN
    IF NEW.salary > 70000 THEN
        SET NEW.salary = 70000;
    END IF;
END;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">In a BEFORE trigger, you can also change its value with <br>SET NEW.col_name = value <br>if you have the UPDATE privilege for it<br><br>
Lets Try Again
We need to Update OLD VALUE Manually?
</div>

In [114]:
%%sql
CREATE TRIGGER limit_salary_increase
AFTER UPDATE ON employees
FOR EACH ROW

BEGIN 
    IF NEW.salary > 70000 THEN
        UPDATE employees
            SET NEW.salary = 70000
            WHERE id = OLD.id;
    END IF;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [115]:
%sql SELECT * FROM employees;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'Mubeen', 70000)]

In [116]:
%sql UPDATE employees SET salary = 80000 WHERE id = 1;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
(pymysql.err.OperationalError) (4048, "Invalid target for assignment in INSERT or UPDATE statement 'NEW.salary'.")
[SQL: UPDATE employees SET salary = 80000 WHERE id = 1;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
This Error Because i use after Triggers that means New.salary are used 
</div>

In [117]:
%sql SELECT * FROM employees;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'Mubeen', 70000)]

In [120]:
%%sql
CREATE TRIGGER limit_salary_increase
AFTER UPDATE ON employees
FOR EACH ROW

SET 
@new = NEW.salary,
@old = OLD.salary;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [121]:
%sql UPDATE employees SET salary = 80000 WHERE id = 1;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [122]:
%sql SELECT @old,@new;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(70000, 80000)]

In [123]:
%sql SELECT * FROM employees;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'Mubeen', 80000)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
SO it means when i use after trigger than new.salary treat like a 80000<br>
Lets try again what happend if we update salary ?
</div>

In [124]:
%%sql
DROP TRIGGER limit_salary_increase;

CREATE TRIGGER limit_salary_increase
AFTER UPDATE ON employees
FOR EACH ROW

BEGIN 
    IF NEW.salary > 70000 THEN
        UPDATE employees
            SET salary = OLD.salary
            WHERE id = NEW.id;
    END IF;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
0 rows affected.

[]

In [125]:
%sql UPDATE employees SET salary = 80000 WHERE id = 1;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
(pymysql.err.OperationalError) (1442, "Can't update table 'employees' in stored function/trigger because it is already used by statement which invoked this stored function/trigger.")
[SQL: UPDATE employees SET salary = 80000 WHERE id = 1;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
we cant re update using after-trigger bcz actual value are already updated
</div>

<hr>
<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Useful Examples</h1>

In [4]:
%%sql 
CREATE TABLE account(
    uid INT NOT NULL,
    username VARCHAR(255) PRIMARY KEY UNIQUE,
    name VARCHAR(255)
    )

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [7]:
%sql SELECT * FROM account;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [8]:
%%sql 
CREATE TABLE logs(
    uid INT,
    username VARCHAR(255)
)

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [9]:
%sql SELECT * FROM logs;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]


<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Create Trigger for Insertion (Before)
</div>

In [10]:
%%sql

CREATE TRIGGER unique_uid
BEFORE INSERT 
ON account FOR EACH ROW
BEGIN
    DECLARE max_id INT DEFAULT 1;
    SELECT MAX(uid)+1 INTO max_id FROM account;

    IF max_id IS NULL THEN
        SET max_id = 1;
    END IF;
    SET 

    NEW.uid = max_id;
    INSERT INTO logs(uid,username) VALUES(NEW.uid,NEW.username);
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [151]:
%sql DROP TRIGGER unique_uid

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [11]:
%sql SELECT * FROM logs;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [12]:
%%sql 
INSERT INTO account(username,name) 
VALUES('mubeen123','mubeen')

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [13]:
%sql SELECT * FROM account;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'mubeen123', 'mubeen')]

In [14]:
%sql SELECT * FROM logs;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'mubeen123')]

In [15]:
%%sql 
INSERT INTO account(username,name) 
VALUES('ali589','Ali')

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [16]:
%sql SELECT * FROM account;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(2, 'ali589', 'Ali'), (1, 'mubeen123', 'mubeen')]

In [17]:
%sql SELECT * FROM logs;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(1, 'mubeen123'), (2, 'ali589')]

In [19]:
%%sql
CREATE TABLE logs_actions(
    uid INT,
    action VARCHAR(255),
    timestamp TIMESTAMP DEFAULT CURRENT_TIMESTAMP
    )

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Create Trigger for Insertion (after)
</div>

In [22]:
%%sql
CREATE TRIGGER after_insertion
AFTER INSERT 
ON logs FOR EACH ROW
BEGIN
    INSERT INTO logs_actions(uid,action)
    VALUES(NEW.uid,'INSERT');
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Now Truncate all Tables
</div>

In [52]:
%%sql
TRUNCATE TABLE account;
TRUNCATE TABLE logs;
TRUNCATE TABLE logs_actions;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [53]:
%%sql

INSERT INTO account(username,name) 
VALUES('mubeen123','mubeen')

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Now Check all Tables
</div>

In [54]:
%sql SELECT * FROM account;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'mubeen123', 'mubeen')]

In [55]:
%sql SELECT * FROM logs;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'mubeen123')]

In [56]:
%sql SELECT * FROM logs_actions;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'INSERT', datetime.datetime(2024, 3, 22, 3, 17, 37))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
CREATE Trigger Update (Before)
</div>

In [47]:
%%sql
CREATE TRIGGER before_update
BEFORE UPDATE
ON account FOR EACH ROW
BEGIN
    UPDATE logs SET username = NEW.username WHERE uid = OLD.uid;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
CREATE Trigger Update (After)
</div>

In [35]:
%%sql
CREATE TRIGGER after_update
AFTER UPDATE
ON logs FOR EACH ROW
BEGIN
    INSERT logs_actions(uid,action)
    VALUES(OLD.uid,"UPDATE");
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

In [57]:
%sql SELECT * FROM account;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'mubeen123', 'mubeen')]

In [58]:
%%sql
UPDATE account SET 
    username = 'ahmad123',
    name = 'ahmad'
    WHERE uid = 1;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [59]:
%sql SELECT * FROM account;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'ahmad123', 'ahmad')]

In [60]:
%sql SELECT * FROM logs;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(1, 'ahmad123')]

In [61]:
%sql SELECT * FROM logs_actions;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(1, 'INSERT', datetime.datetime(2024, 3, 22, 3, 17, 37)),
 (1, 'UPDATE', datetime.datetime(2024, 3, 22, 3, 18, 1))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Now Insert New Data
</div>

In [62]:
%%sql
INSERT INTO account(username,name)
VALUES('Rizwan223','Rizwan')

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [63]:
%sql SELECT * FROM account;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(1, 'ahmad123', 'ahmad'), (2, 'Rizwan223', 'Rizwan')]

In [64]:
%sql SELECT * FROM logs;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(1, 'ahmad123'), (2, 'Rizwan223')]

In [65]:
%sql SELECT * FROM logs_actions;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
3 rows affected.

[(1, 'INSERT', datetime.datetime(2024, 3, 22, 3, 17, 37)),
 (1, 'UPDATE', datetime.datetime(2024, 3, 22, 3, 18, 1)),
 (2, 'INSERT', datetime.datetime(2024, 3, 22, 3, 19, 32))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
Now Update Again uid 1 Data
</div>

In [66]:
%sql SELECT * FROM account;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(1, 'ahmad123', 'ahmad'), (2, 'Rizwan223', 'Rizwan')]

In [67]:
%%sql
UPDATE account SET 
    username = 'mubeen123',
    name = 'Mubeen'
    WHERE uid = 1;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [68]:
%sql SELECT * FROM account;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(1, 'mubeen123', 'Mubeen'), (2, 'Rizwan223', 'Rizwan')]

In [69]:
%sql SELECT * FROM logs;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(1, 'mubeen123'), (2, 'Rizwan223')]

In [70]:
%sql SELECT * FROM logs_actions;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
4 rows affected.

[(1, 'INSERT', datetime.datetime(2024, 3, 22, 3, 17, 37)),
 (1, 'UPDATE', datetime.datetime(2024, 3, 22, 3, 18, 1)),
 (2, 'INSERT', datetime.datetime(2024, 3, 22, 3, 19, 32)),
 (1, 'UPDATE', datetime.datetime(2024, 3, 22, 3, 21, 2))]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
CREATE Trigger DELETE (Before)
</div>

In [72]:
%%sql
CREATE TRIGGER before_delete
BEFORE DELETE
ON account FOR EACH ROW
BEGIN
    DELETE FROM logs WHERE uid = OLD.uid;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.

[]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
CREATE Trigger DELETE (After)
</div>

In [83]:
%%sql
CREATE TRIGGER after_delete
AFTER DELETE
ON account FOR EACH ROW
BEGIN
    DELETE FROM logs_actions WHERE uid = OLD.uid;
END;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
0 rows affected.
0 rows affected.

[]

In [84]:
%sql SELECT * FROM account;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
2 rows affected.

[(1, 'mubeen123', 'Mubeen'), (2, 'Rizwan223', 'Rizwan')]

In [85]:
%%sql
DELETE FROM account WHERE uid = 1

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[]

In [86]:
%sql SELECT * FROM account;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(2, 'Rizwan223', 'Rizwan')]

In [87]:
%sql SELECT * FROM logs;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(2, 'Rizwan223')]

In [88]:
%sql SELECT * FROM logs_actions;

 * mysql+pymysql://sweeterror404:***@localhost:3306/mubeen
1 rows affected.

[(2, 'INSERT', datetime.datetime(2024, 3, 22, 3, 19, 32))]